app/Models/Products.php

select `tags`.*, `products_tags`.`product_id` as `pivot_product_id`, `products_tags`.`tag_id` as `pivot_tag_id` from `tags` inner join `products_tags` on `tags`.`id` = `products_tags`.`tag_id` where `products_tags`.`product_id` = 1
---
    protected function getTagsPluckedAttribute()
    {
        return $this->tags->pluck('title', 'id')->toArray();

select `images`.*, `products_images`.`product_id` as `laravel_through_key` from `images` inner join `products_images` on `products_images`.`image_id` = `images`.`id` where `products_images`.`product_id` = 1 order by `priority` asc
---
    protected function getImagesWithPriorityAttribute()
    {
        return $this->images->map(function($item, $key) {
            $item->priority = $key;
            return $item;
        })->toArray();