app/Http/Controllers/Admin/ProductsController.php

    public function index(Request $request): View
    {
        $products = Products::paginate(5);
---
select * from `products` where `products`.`deleted_at` is null limit 5 offset 5
select count(*) as aggregate from `products` where `products`.`deleted_at` is null

    public function update(Request $request, Products $product): View
    {
        $sizes = ProductsSizes::pluck('size', 'id')->toArray();
        $tags = Tags::pluck('title', 'id')->toArray();
---
select `size`, `id` from `products_sizes`
select `title`, `id` from `tags`

    public function save(SaveRequest $request, Products $product): JsonResponse
    {
        $productData = $request->validated();

        $productId = request()->get('product_id');
        if ($productId) {
            $product = Products::find($productId);
---
select * from `products` where `products`.`id` = 1 and `products`.`deleted_at` is null limit 1


        $tagIds = [];
        foreach ($productData['current_tags'] as $tagData) {
            $tag = Tags::firstOrCreate([
                'title' => $tagData['title']
            ]);
---
insert into `tags` (`title`, `updated_at`, `created_at`) values ('gluten free', '2024-09-11 18:48:17', '2024-09-11 18:48:17')
select * from `tags` where (`title` = 'honey') limit 1

        // }
        if (isset($productData['images'])) {
            foreach ($productData['images'] as $imageData) {
                $imageExists = ProductsImages::where('product_id', $product->id)
                    ->where('image_id', $imageData['id'])
                    ->first();

                if ($imageExists) {
                    ProductsImages::where('product_id', $product->id)
                        ->where('image_id', $imageData['id'])
                        ->update([
                            'priority' => $imageData['priority'],
                        ]);
---
select * from `products_images` where `product_id` = 1 and `image_id` = 405 limit 1
update `products_images` set `priority` = 0 where `product_id` = 1 and `image_id` = 405